> We still have a test failure here:
> 
> ```
> ------- Stdout: -------
> === RUN   TestAccKustoCluster_zones
> === PAUSE TestAccKustoCluster_zones
> === CONT  TestAccKustoCluster_zones
>     testcase.go:110: Step 1/1 error: After applying this test step and performing a `terraform refresh`, the plan was not empty.
>         stdout
>         
>         
>         Terraform used the selected providers to generate the following execution
>         plan. Resource actions are indicated with the following symbols:
>         -/+ destroy and then create replacement
>         
>         Terraform will perform the following actions:
>         
>           # azurerm_kusto_cluster.test must be replaced
>         -/+ resource "azurerm_kusto_cluster" "test" {
>               ~ data_ingestion_uri            = "https://ingest-acctestkchfjj2.eastus2.kusto.windows.net/" -> (known after apply)
>               - double_encryption_enabled     = false -> null
>               ~ id                            = "/subscriptions/*******/resourceGroups/acctestRG-220608200522335526/providers/Microsoft.Kusto/Clusters/acctestkchfjj2" -> (known after apply)
>               - language_extensions           = [] -> null
>                 name                          = "acctestkchfjj2"
>               - tags                          = {} -> null
>               ~ trusted_external_tenants      = [] -> (known after apply)
>               ~ uri                           = "https://acctestkchfjj2.eastus2.kusto.windows.net/" -> (known after apply)
>               ~ zones                         = [ # forces replacement
>                   - "1",
>                   + "3",
>                 ]
>                 # (8 unchanged attributes hidden)
>         
>                 # (1 unchanged block hidden)
>             }
>         
>         Plan: 1 to add, 0 to change, 1 to destroy.
> --- FAIL: TestAccKustoCluster_zones (1266.27s)
> FAIL
> ```

I have checked this one, this is related to kusto service API behavior and I will reach out to them to see what is the expected behavior of this API and determine whether this is suitable for us to add this "zone" property to azure provider of terraform.